---
kind: method
id: M:Autodesk.Revit.DB.STEPImportOptions.#ctor
source: html/e5e8478c-d90d-9971-9e51-496d4a5b04cb.htm
---
# Autodesk.Revit.DB.STEPImportOptions.#ctor Method

Constructs a new instance of STEPImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public STEPImportOptions()
```